apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
		// Asegúrate de que el mensaje sea tratado como una cadena de texto
		char message[BLE_NUS_MAX_DATA_LEN + 1];  // +1 para el carácter nulo
		if (p_evt->params.rx_data.length < sizeof(message))
		{
			memcpy(message, p_evt->params.rx_data.p_data,
			       p_evt->params.rx_data.length);
			message[p_evt->params.rx_data.length] =
			    '\0';  // Agregar terminador nulo

			// Verifica si el mensaje comienza con "111"
			if (p_evt->params.rx_data.length >= 5 && message[0] == '1' &&
			    message[1] == '1' && message[2] == '1')
			{
				// Extrae el comando (los dos caracteres después de "111")
				char command[3] = {message[3], message[4],
				                   '\0'};  // Comando de 2 caracteres

				// Manejo de comandos con un switch-case
				switch (atoi(command))  // Convierte el comando a entero
				{
					case 1:  // Comando 01: Guardar MAC
					{
						size_t mac_length = p_evt->params.rx_data.length - 5;
						if (mac_length ==
						    12)  // Verifica que la longitud sea válida
						{
							for (size_t i = 0; i < 6; i++)
							{
								char byte_str[3] = {message[5 + i * 2],
								                    message[6 + i * 2], '\0'};
								custom_mac_addr_[i] =
								    (uint8_t)strtol(byte_str, NULL, 16);
							}
							NRF_LOG_RAW_INFO(
							    "\n\n\x1b[1;36m--- Comando 01 recibido: "
							    "Cambiar MAC \x1b[0m");
							NRF_LOG_RAW_INFO(
							    "\n> MAC recibida: "
							    "%02X:%02X:%02X:%02X:%02X:%02X",
							    custom_mac_addr_[0], custom_mac_addr_[1],
							    custom_mac_addr_[2], custom_mac_addr_[3],
							    custom_mac_addr_[4], custom_mac_addr_[5]);

							// Guarda la MAC en la memoria flash y reinicia el
							// dispositivo
							save_mac_to_flash_and_reset(custom_mac_addr_);
						}
						else
						{
							NRF_LOG_WARNING("Longitud de MAC inválida: %d",
							                mac_length);
						}
						break;
					}
					case 2:  // Comando 02: Muestra la MAC custom guardada en la
					         // memoria flash
					{
						// Carga la MAC desde la memoria flash
						NRF_LOG_RAW_INFO(
						    "\n\n\x1b[1;36m--- Comando 02 recibido: Mostrando "
						    "MAC "
						    "guardada \x1b[0m");
						load_mac_from_flash();
						// muestra la MAC
					}

					break;

					case 3:  // Comando 03: Reiniciar el dispositivo
						NRF_LOG_RAW_INFO(
						    "\n\n\x1b[1;36m--- Comando 03 recibido: "
						    "Reiniciando "
						    "dispositivo...\n\n\n\n");
						nrf_delay_ms(1000);
						NVIC_SystemReset();

						break;

					case 4:  // Guardar tiempo de encendido
					{
						if (p_evt->params.rx_data.length >=
						    6)  // Verifica que haya datos suficientes
						{
							char time_str[4] = {message[5], message[6],
							                    message[7], '\0'};
							uint32_t time_in_seconds
							    __attribute__((aligned(4))) =
							        atoi(time_str) * 1000;
							if (time_in_seconds <=
							    666000)  // Verifica que no exceda el máximo
							             // permitido
							{
								NRF_LOG_RAW_INFO(
								    "\n\n\x1b[1;36m--- Comando 04 recibido: "
								    "Cambiar tiempo de encendido \x1b[0m");
								write_time_to_flash(TIEMPO_ENCENDIDO,
								                    time_in_seconds);
							}
							else
							{
								NRF_LOG_WARNING(
								    "El tiempo de encendido excede el máximo "
								    "permitido (666 segundos).");
							}
						}
						else
						{
							NRF_LOG_WARNING(
							    "Comando 04 recibido con datos insuficientes.");
						}
						break;
					}

					case 5:  // Comando 05: Leer tiempo de encendido desde la
					         // memoria flash
					{
						NRF_LOG_RAW_INFO(
						    "\n\n\x1b[1;36m--- Comando 05 recibido: "
						    "Leer tiempo de encendido \x1b[0m");
						uint32_t sleep_time_ms = read_time_from_flash(
						    TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS);

						break;
					}

					case 6:  // Comando 06: Guardar tiempo de apagado
					{
						if (p_evt->params.rx_data.length >=
						    6)  // Verifica que haya datos suficientes
						{
							char time_str[4] = {message[5], message[6],
							                    message[7], '\0'};
							uint32_t time_in_seconds
							    __attribute__((aligned(4))) =
							        atoi(time_str) * 1000;
							if (time_in_seconds <=
							    666000)  // Verifica que no exceda el máximo
							             // permitido
							{
								NRF_LOG_RAW_INFO(
								    "\n\n\x1b[1;36m--- Comando 06 recibido: "
								    "Cambiar tiempo de dormido \x1b[0m");
								write_time_to_flash(TIEMPO_SLEEP,
								                    time_in_seconds);
							}
							else
							{
								NRF_LOG_WARNING(
								    "El tiempo de dormido excede el máximo "
								    "permitido (666 segundos).");
							}
						}
						else
						{
							NRF_LOG_WARNING(
							    "Comando 06 recibido con datos insuficientes.");
						}
						break;
					}

					case 7:  // Comando 07: Leer tiempo de apagado desde la
					         // memoria flash
					{
						NRF_LOG_RAW_INFO(
						    "\n\n\x1b[1;36m--- Comando 07 recibido: "
						    "Leer tiempo de dormido\x1b[0m");
						uint32_t sleep_time_ms = read_time_from_flash(
						    TIEMPO_SLEEP, DEFAULT_DEVICE_SLEEP_TIME_MS);

							break;
					}

					default:  // Comando desconocido
						NRF_LOG_WARNING("Comando desconocido: %s", command);
						break;
				}
			}
			else
			{
				// Reenvía el mensaje al emisor o lo maneja normalmente
				if (m_on_data_received)
				{
					m_on_data_received((uint8_t*)message,
					                   p_evt->params.rx_data.length);
				}
			}
		}
		else
		{
			NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
		}
	}
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access
 * Profile) parameters of the device. It also sets the permissions and
 * appearance.
 */
static void gap_params_init(void)
{
	uint32_t err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

